stator/system/innerPoint
// define a point inside the mesh
innerPoint (0 -223 0);